import { PROJECT_NAME } from "../../constants";

export const teamMembers = [
  {
    name: "Вольхин Данил",
    role: "Lead FullStack AI Developer",
    description: "Тимлид команды.",
    location: "Москва, Россия",
    work: "Sber|AtlasIT",
    github: "https://github.com/deneal123",
    email: "dfvolkhin@edu.hse.ru",
  },
  {
    name: "Это ты",
    role: "New Team Member",
    description: "Присоединяйся к нам!",
    location: "Где угодно",
    work: "В поисках работы",
  },
  {
    name: "Это ты",
    role: "New Team Member",
    description: "Присоединяйся к нам!",
    location: "Где угодно",
    work: "В поисках работы",
  },
  {
    name: "Это ты",
    role: "New Team Member",
    description: "Присоединяйся к нам!",
    location: "Где угодно",
    work: "В поисках работы",
  },
];

export const teamDescription = `Наша команда сформировалась в 2023 году и с тех пор успела принять участие в семи
  хакатонах, большинство из которых проходили в рамках проекта «Цифровой прорыв: Сезон
  искусственного интеллекта». MLservice — это концентрация хаоса, к которому мы так
  привыкли в процессе работы и обучения. Мы гордимся тем, что смогли объединить усилия и
  выкатить хоть какую-то работоспособную версию продукта.`;

export const advantagesList = [
  {
    title: "🚀 Скорость",
    description:
      "Классические ML модели работают на технологии RAPIDS для ускорения вычислений на GPU",
  },
  {
    title: "🔧 Гибкость",
    description:
      "Поддержка кастомизации и расширяемости для решения специфических задач",
  },
  {
    title: "📊 Визуализация",
    description:
      "Отслеживание метрик и логов в реальном времени через удобный дашборд",
  },
  {
    title: "🔒 Безопасность",
    description:
      "JWT-аутентификация, RBAC, TSL и шифрование данных для защиты информации",
  },
  {
    title: "🎨 Приятный интерфейс",
    description:
      "Современный UI с анимациями, dark mode и адаптивный дизайн для всех устройств",
  },
  {
    title: "🎯 Специализация",
    description:
      "Оптимизирован для ML-задач с поддержкой популярных фреймворков и библиотек",
  },
];

export const techStackList = [
  "FastAPI",
  "Alembic",
  "PostgreSQL",
  "React",
  "Chakra UI",
  "Docker",
  "Nginx",
  "Pydantic",
  "Scikit-learn",
  "Redis",
];

export const projectAdvantagesTitle = `Преимущества ${PROJECT_NAME}`;
