import { PROJECT_NAME, COMPANY_NAME } from "@constants";

export const teamMembers = [
  {
    name: "Вольхин Данил",
    role: "Lead FullStack AI Developer",
    description: "Тимлид команды.",
    location: "Москва, Россия",
    work: "Sber|AtlasIT",
    github: "https://github.com/deneal123",
    email: "dfvolkhin@edu.hse.ru",
  },
  {
    name: "Это ты",
    role: "New Team Member",
    description: "Присоединяйся к нам!",
    location: "Где угодно",
    work: "В поисках работы",
  },
  {
    name: "Это ты",
    role: "New Team Member",
    description: "Присоединяйся к нам!",
    location: "Где угодно",
    work: "В поисках работы",
  },
  {
    name: "Это ты",
    role: "New Team Member",
    description: "Присоединяйся к нам!",
    location: "Где угодно",
    work: "В поисках работы",
  },
];

export const teamDescription = `В 23 году наш тимлид и основатель будущей корпорации ${COMPANY_NAME} собрал небольшую группу
бездарей (в том числе и себя) для участия в хакатонах, чтобы хоть где-то залутать еды (ведь в крупный бигтех нас брать не хотели)
Довольно успешно занимали топ 10 на последующих девяти хакатонах, но этого было нам мало. Конечно, некоторые из нас побывали в лучших
крупных компаниях нашей страны, но платный хафчик в столовой? Вы серьезно? Так родилась идея создать свою корпу, где люди
могли бы кушать что угодно и когда угодно. Мы представляем наше первое недоношенное дитя - ${PROJECT_NAME}, платформа для развёртывания ML-моделей.`;

export const advantagesList = [
  {
    title: "🚀 Скорость",
    description:
      "Классические ML модели работают на технологии RAPIDS для ускорения вычислений на GPU",
  },
  {
    title: "🔧 Гибкость",
    description: "Поддержка кастомизации и расширяемости для решения специфических задач",
  },
  {
    title: "📊 Визуализация",
    description: "Отслеживание метрик и логов в реальном времени через удобный дашборд",
  },
  {
    title: "🔒 Безопасность",
    description: "JWT-аутентификация, RBAC, TSL и шифрование данных для защиты информации",
  },
  {
    title: "🎨 Приятный интерфейс",
    description: "Современный UI с анимациями, dark mode и адаптивный дизайн для всех устройств",
  },
  {
    title: "🎯 Специализация",
    description: "Оптимизирован для ML-задач с поддержкой популярных фреймворков и библиотек",
  },
];

export const techStackList = [
  "FastAPI",
  "Alembic",
  "PostgreSQL",
  "React",
  "Chakra UI",
  "Docker",
  "Nginx",
  "Pydantic",
  "Scikit-learn",
  "Redis",
];

export const projectAdvantagesTitle = `Преимущества ${PROJECT_NAME}`;
